73
32
72
65
68
32
97
108
119
97
121
115
257
104
265
103
104
259
74
97
99
107
32
71
105
115
98
117
114
110
32
114
97
116
104
266
32
97
32
99
104
101
97
112
32
103
269
105
117
115
45
45
116
104
265
103
104
32
97
32
103
111
111
258
102
101
108
108
111
119
32
269
265
103
104
45
45
115
273
105
259
119
97
261
110
273
103
114
101
97
259
115
117
114
112
114
105
115
256
116
273
109
256
116
273
104
101
97
114
257
263
116
264
260
270
104
101
105
103
104
259
111
102
32
275
261
103
108
111
114
121
264
262
263
258
100
114
111
112
112
101
258
275
261
112
97
260
116
274
264
109
97
114
114
105
101
258
97
32
114
105
99
104
32
119
105
100
111
119
264
267
258
101
115
116
97
98
108
105
115
104
101
258
275
109
115
101
108
102
32
260
32
97
32
118
105
108
108
97
32
268
270
82
105
118
105
266
97
272
40
84
104
265
103
104
32
73
32
114
97
116
104
266
257
104
265
103
104
259
105
259
119
265
108
258
263
118
256
98
101
269
32
82
111
109
256
111
114
32
70
108
111
114
269
99
101
46
41
10
10
34
84
262
104
101
105
103
104
259
111
102
32
275
261
103
108
111
114
121
34
45
45
116
263
259
119
97
261
119
263
116
270
119
111
109
269
32
99
97
108
108
101
258
105
116
272
73
32
99
267
32
104
101
97
114
32
77
114
115
272
71
105
100
101
268
32
84
104
119
274
45
45
275
261
108
97
115
259
67
275
99
97
103
273
115
105
116
116
266
45
45
100
101
112
108
111
114
274
32
275
261
117
110
97
99
99
265
110
116
97
98
108
256
97
98
100
105
99
97
116
105
268
272
34
79
102
32
99
265
114
115
256
105
116
39
261
103
111
274
257
273
115
269
100
270
118
97
108
117
256
111
102
32
109
271
112
105
99
116
117
114
256
39
119
97
271
117
112
59
32
98
117
259
73
32
100
268
39
116
257
104
260
107
32
111
102
257
263
116
264
77
114
272
82
105
99
107
263
109
45
45
116
262
108
111
115
115
257
273
65
114
114
259
105
261
97
108
108
32
73
257
104
260
107
32
111
102
46
34
32
84
262
119
111
114
100
264
268
32
77
114
115
272
84
104
119
274
39
261
108
105
112
115
264
109
117
108
116
105
112
108
105
101
258
105
116
261
95
114
115
95
32
97
115
257
104
265
103
104
257
104
101
271
119
266
256
114
101
102
108
101
99
116
101
258
260
32
267
32
269
100
108
101
115
261
118
105
115
116
97
32
111
102
32
109
105
114
114
111
114
115
272
65
110
258
105
259
119
97
261
110
111
259
268
108
121
270
77
114
115
272
84
104
119
274
261
119
104
273
109
265
114
110
101
100
272
72
97
258
110
111
116
270
101
120
113
117
105
115
105
116
256
72
266
109
105
97
32
67
114
111
102
116
264
97
116
270
108
97
115
259
71
114
97
102
116
268
32
71
97
108
108
266
271
115
104
111
119
264
115
116
111
112
112
101
258
109
256
98
101
102
111
114
256
71
105
115
98
117
114
110
39
261
34
77
111
268
45
100
267
99
266
115
34
257
273
115
97
121
264
119
105
116
104
257
101
97
114
261
260
32
104
266
32
101
121
101
115
58
32
34
87
256
115
263
108
108
32
110
111
259
108
111
111
107
32
117
112
268
32
105
116
261
108
105
107
256
97
103
97
260
34
63
10
10
87
101
108
108
33
45
45
101
118
269
257
104
114
265
103
104
270
112
114
105
115
109
32
111
102
32
72
266
109
105
97
39
115
257
101
97
114
261
73
32
102
101
108
259
97
98
108
256
116
273
102
97
99
256
116
262
102
97
99
259
119
105
116
104
32
101
113
117
267
105
109
105
116
121
272
80
111
111
114
32
74
97
99
107
32
71
105
115
98
117
114
110
33
32
84
262
119
111
109
269
32
263
258
109
97
100
256
275
109
45
45
105
259
119
97
261
102
105
116
116
274
257
263
116
257
104
101
271
115
104
265
108
258
109
265
114
110
32
275
109
272
65
109
268
103
32
275
261
111
119
110
32
115
101
120
32
102
101
119
266
32
114
101
103
114
101
116
261
119
266
256
104
101
97
114
100
264
267
258
260
32
275
261
111
119
110
257
114
97
100
256
263
114
100
108
271
97
32
109
117
114
109
117
114
272
80
114
111
102
101
115
115
105
268
97
108
32
106
101
97
108
265
115
121
63
32
80
266
263
112
115
272
73
102
32
105
259
119
266
101
44
270
104
268
265
114
32
111
102
270
99
114
97
102
259
119
97
261
118
260
100
105
99
97
116
101
258
98
271
108
105
116
116
108
256
67
108
97
117
100
256
78
117
116
108
101
121
264
119
104
111
264
260
32
97
108
108
32
103
111
111
258
102
97
105
116
104
264
98
114
265
103
104
259
265
259
260
270
66
117
114
108
274
116
268
32
97
32
118
266
271
263
110
100
115
111
109
256
34
111
98
105
116
117
97
114
121
34
32
268
32
74
97
99
107
45
45
268
256
111
102
257
104
111
115
256
115
104
111
119
271
97
114
116
105
99
108
101
261
115
116
111
99
107
101
258
119
105
116
104
32
114
267
100
111
109
257
101
99
104
110
105
99
97
108
105
116
105
101
115
257
263
259
73
32
263
118
256
104
101
97
114
258
40
73
32
119
268
39
259
115
97
271
98
271
119
104
111
109
41
32
99
111
109
112
97
114
101
100
257
273
71
105
115
98
117
114
110
39
261
112
97
260
116
274
272
65
110
258
115
111
45
45
275
261
114
101
115
111
108
118
256
98
101
274
32
97
112
112
97
114
269
116
108
271
105
114
114
101
118
111
99
97
98
108
101
45
45
116
262
100
105
115
99
117
115
115
105
268
32
103
114
97
100
117
97
108
108
271
100
105
101
258
265
116
264
267
100
264
97
261
77
114
115
272
84
104
119
274
32
263
258
112
114
101
100
105
99
116
101
100
44
270
112
114
105
99
256
111
102
32
34
71
105
115
98
117
114
110
115
34
32
119
269
259
117
112
46
10
10
73
259
119
97
261
110
111
116
257
105
108
108
257
104
114
101
256
121
101
97
114
261
108
97
116
266
257
263
116
264
260
270
99
265
114
115
256
111
102
32
97
32
102
101
119
32
119
101
101
107
115
39
32
105
100
108
274
32
268
270
82
105
118
105
266
97
264
105
259
115
117
100
100
269
108
271
111
99
99
117
114
114
101
100
257
273
109
256
116
273
119
268
100
266
32
119
104
271
71
105
115
98
117
114
110
32
263
258
103
105
118
269
32
117
112
32
275
261
112
97
260
116
274
272
79
110
32
114
101
102
108
101
99
116
105
268
264
105
259
114
101
97
108
108
271
119
97
261
97
257
101
109
112
116
274
32
112
114
111
98
108
101
109
272
84
273
97
99
99
117
115
256
275
261
119
105
102
256
119
265
108
258
263
118
256
98
101
269
257
111
273
101
97
115
121
45
45
275
261
102
97
105
114
32
115
105
116
116
266
261
263
258
98
101
269
32
100
269
105
101
100
270
115
111
108
97
99
256
111
102
32
115
97
121
274
257
263
259
77
114
115
272
71
105
115
98
117
114
110
32
263
258
34
100
114
97
103
103
101
258
275
109
32
100
111
119
110
46
34
32
70
111
114
32
77
114
115
272
71
105
115
98
117
114
110
45
45
97
261
115
117
99
104
45
45
263
258
110
111
259
101
120
105
115
116
101
100
257
105
108
108
32
110
101
97
114
108
271
97
32
121
101
97
114
32
97
102
116
266
32
74
97
99
107
39
261
114
101
115
111
108
118
256
263
258
98
101
269
257
97
107
269
272
73
259
109
105
103
104
259
98
256
116
263
259
262
263
258
109
97
114
114
105
101
258
104
266
45
45
115
260
99
256
262
108
105
107
101
258
275
261
101
97
115
101
45
45
98
101
99
97
117
115
256
262
100
105
100
110
39
259
119
267
116
257
273
103
273
268
32
112
97
260
116
274
59
32
98
117
259
105
259
119
265
108
258
263
118
256
98
101
269
32
263
114
100
257
273
112
114
111
118
256
116
263
259
262
263
258
103
105
118
269
32
117
112
32
275
261
112
97
260
116
274
32
98
101
99
97
117
115
256
262
263
258
109
97
114
114
105
101
258
104
266
46
10
10
79
102
32
99
265
114
115
101
264
105
102
32
115
262
263
258
110
111
259
100
114
97
103
103
101
258
275
109
32
100
111
119
110
264
115
262
263
258
101
113
117
97
108
108
121
264
97
261
77
105
115
261
67
114
111
102
259
99
268
116
269
100
101
100
264
102
97
105
108
101
100
257
273
34
108
105
102
259
275
109
32
117
112
34
45
45
115
262
263
258
110
111
259
108
101
258
275
109
32
98
97
99
107
257
111
270
101
97
115
101
108
272
84
273
112
117
116
270
98
114
117
115
104
32
260
116
273
275
261
263
110
258
97
103
97
260
45
45
119
263
259
97
32
118
111
99
97
116
105
268
32
102
111
114
32
97
32
119
105
102
101
33
32
66
117
259
77
114
115
272
71
105
115
98
117
114
110
32
97
112
112
101
97
114
101
100
257
273
263
118
256
100
105
115
100
97
260
101
258
105
116
45
45
267
258
73
32
102
101
108
259
105
259
109
105
103
104
259
98
256
260
116
266
101
115
116
274
257
273
102
260
258
265
259
119
104
121
46
10
10
84
262
100
101
115
117
108
116
111
114
271
108
105
102
256
111
102
270
82
105
118
105
266
97
32
108
269
100
261
105
116
115
101
108
102
257
273
115
117
99
104
32
112
117
114
101
108
271
97
99
97
100
101
109
105
99
32
115
112
101
99
117
108
97
116
105
268
115
59
32
267
258
263
118
274
264
268
32
109
271
119
97
121
257
273
77
268
116
256
67
97
114
108
111
264
99
97
117
103
104
259
97
32
103
108
105
109
112
115
256
111
102
32
74
97
99
107
39
261
98
97
108
117
115
116
114
97
100
101
100
257
266
114
97
99
101
261
98
101
116
119
101
269
270
112
260
101
115
264
73
32
263
258
109
121
115
101
108
102
32
98
111
114
110
256
116
275
116
104
266
270
110
101
120
259
100
97
121
46
10
10
73
32
102
265
110
100
270
99
265
112
108
256
97
116
257
101
97
32
98
269
101
97
116
104
257
104
101
105
114
32
112
97
108
109
45
116
114
101
101
115
59
32
267
258
77
114
115
272
71
105
115
98
117
114
110
39
261
119
101
108
99
111
109
256
119
97
261
115
273
103
269
105
97
108
257
263
116
264
260
270
269
115
117
274
32
119
101
101
107
115
264
73
32
99
108
97
105
109
101
258
105
259
102
114
101
113
117
269
116
108
121
272
73
259
119
97
261
110
111
116
257
263
259
109
271
104
111
115
116
101
115
261
119
97
261
34
260
116
266
101
115
116
274
34
58
32
268
257
263
259
112
111
260
259
73
32
99
265
108
258
263
118
256
103
105
118
269
32
77
105
115
261
67
114
111
102
116
270
102
117
108
108
101
115
259
114
101
97
115
115
117
114
267
99
101
272
73
259
119
97
261
106
117
115
259
98
101
99
97
117
115
256
115
262
119
97
261
95
110
111
116
95
32
260
116
266
101
115
116
274
45
45
105
102
32
73
32
109
97
271
98
256
112
97
114
100
268
101
100
270
98
117
108
108
45
45
116
263
259
73
32
102
265
110
258
104
266
32
115
111
272
70
111
114
32
74
97
99
107
264
97
108
108
32
275
261
108
105
102
101
264
263
258
98
101
269
32
115
117
114
114
265
110
100
101
258
98
271
260
116
266
101
115
116
274
32
119
111
109
269
58
257
104
101
271
263
258
102
111
115
116
266
101
258
275
261
97
114
116
264
105
259
263
258
98
101
269
32
114
101
97
114
101
258
260
270
104
111
116
45
104
265
115
256
111
102
257
104
101
105
114
32
97
100
117
108
97
116
105
268
272
65
110
258
105
259
119
97
115
257
104
266
101
102
111
114
256
260
115
116
114
117
99
116
105
118
256
116
273
110
111
116
256
119
263
259
101
102
102
101
99
116
270
34
100
101
97
100
269
274
32
97
116
109
111
115
112
104
266
256
111
102
32
109
101
100
105
111
99
114
105
116
121
34
32
40
73
32
113
117
111
116
256
77
105
115
261
67
114
111
102
116
41
32
119
97
261
263
118
274
32
268
32
275
109
46
10
10
73
32
263
118
256
109
269
116
105
268
101
100
257
263
259
77
114
115
272
71
105
115
98
117
114
110
32
119
97
261
114
105
99
104
59
32
267
258
105
259
119
97
261
105
109
109
101
100
105
97
116
101
108
271
112
266
99
101
112
116
105
98
108
256
116
263
259
104
266
32
104
117
115
98
267
258
119
97
261
101
120
116
114
97
99
116
274
32
102
114
111
109
257
275
261
99
105
114
99
117
109
115
116
267
99
256
97
32
100
101
108
105
99
97
116
256
98
117
259
115
117
98
115
116
267
116
105
97
108
32
115
97
116
105
115
102
97
99
116
105
268
272
73
259
105
115
264
97
261
97
32
114
117
108
101
44
270
112
101
111
112
108
256
119
104
273
115
99
111
114
110
32
109
268
101
271
119
104
273
103
101
259
109
111
115
259
265
259
111
102
32
105
116
59
32
267
258
74
97
99
107
39
261
101
108
101
103
267
259
100
105
115
100
97
260
32
111
102
32
275
261
119
105
102
101
39
261
98
105
103
32
98
97
108
267
99
256
269
97
98
108
101
258
275
109
264
119
105
116
104
32
267
32
97
112
112
101
97
114
267
99
256
111
102
32
112
266
102
101
99
259
103
111
111
100
45
98
114
101
101
100
274
44
257
111
257
114
267
115
109
117
116
256
105
259
260
116
273
111
98
106
101
99
116
261
111
102
32
97
114
259
267
258
108
117
120
117
114
121
272
84
111
270
108
97
116
116
266
264
73
32
109
117
115
259
97
100
100
264
262
114
101
109
97
260
101
258
114
101
108
97
116
105
118
101
108
271
260
100
105
102
102
266
269
116
59
32
98
117
259
262
119
97
261
98
117
121
274
32
82
269
97
105
115
115
267
99
256
98
114
268
122
101
261
267
258
101
105
103
104
116
101
269
116
104
45
99
269
116
117
114
271
112
105
99
116
117
114
101
261
119
105
116
104
32
97
32
100
105
115
99
114
105
109
260
97
116
105
268
257
263
259
98
101
115
112
111
107
256
116
262
97
109
112
108
101
115
259
114
101
115
265
114
99
101
115
46
10
10
34
77
268
101
121
39
261
268
108
271
101
120
99
117
115
256
105
115
257
273
112
117
259
98
101
97
117
116
271
260
116
273
99
105
114
99
117
108
97
116
105
268
44
34
32
119
97
261
268
256
111
102
270
97
120
105
111
109
261
262
108
97
105
258
100
111
119
110
32
97
99
114
111
115
115
270
83
101
118
114
101
261
267
258
115
105
108
118
266
32
111
102
32
267
32
101
120
113
117
105
115
105
116
101
108
271
97
112
112
111
260
116
101
258
108
117
110
99
104
101
268
45
116
97
98
108
101
264
119
104
269
264
268
32
97
32
108
97
116
266
32
100
97
121
264
73
32
263
258
97
103
97
260
32
114
117
110
32
111
118
266
32
102
114
111
109
32
77
268
116
256
67
97
114
108
111
59
32
267
258
77
114
115
272
71
105
115
98
117
114
110
264
98
101
97
109
274
32
268
32
275
109
264
97
100
100
101
258
102
111
114
32
109
271
269
108
105
103
104
116
269
109
269
116
58
32
34
74
97
99
107
32
105
261
115
273
109
111
114
98
105
100
108
271
115
269
115
105
116
105
118
256
116
273
101
118
266
271
102
111
114
109
32
111
102
32
98
101
97
117
116
121
46
34
10
10
80
111
111
114
32
74
97
99
107
33
32
73
259
263
258
97
108
119
97
121
261
98
101
269
32
275
261
102
97
116
256
116
273
263
118
256
119
111
109
269
32
115
97
271
115
117
99
104
257
104
274
261
111
102
32
275
109
58
270
102
97
99
259
115
104
265
108
258
98
256
115
101
259
100
111
119
110
32
260
32
101
120
116
269
117
97
116
105
268
272
87
263
259
115
116
114
117
99
107
32
109
256
110
111
119
32
119
97
115
257
263
116
264
102
111
114
270
102
105
114
115
116
257
105
109
101
264
262
114
101
115
269
116
101
100
270
116
268
101
272
73
32
263
258
115
101
269
32
275
109
264
115
273
111
102
116
269
264
98
97
115
107
274
32
117
110
100
266
32
115
105
109
105
108
97
114
257
114
105
98
117
116
101
115
45
45
119
97
261
105
116
270
99
268
106
117
103
97
108
32
110
111
116
256
116
263
259
114
111
98
98
101
100
257
104
101
109
32
111
102
257
104
101
105
114
32
115
97
118
265
114
63
32
78
111
45
45
102
111
114
264
111
100
100
108
271
269
265
103
104
264
105
259
98
101
99
97
109
256
97
112
112
97
114
269
116
257
263
259
262
119
97
261
102
268
258
111
102
32
77
114
115
272
71
105
115
98
117
114
110
45
45
102
268
258
269
265
103
104
32
110
111
116
257
273
115
101
256
104
266
32
97
98
115
117
114
100
105
116
121
272
73
259
119
97
261
275
261
111
119
110
32
97
98
115
117
114
100
105
116
271
262
115
101
101
109
101
100
257
273
98
256
119
260
99
274
32
117
110
100
266
45
45
275
261
111
119
110
32
97
116
116
105
116
117
100
256
97
261
267
32
111
98
106
101
99
259
102
111
114
32
103
97
114
108
267
100
261
267
258
260
99
269
115
101
46
10
10
34
77
271
100
101
97
114
264
115
260
99
256
73
39
118
256
99
104
117
99
107
101
258
112
97
260
116
274
32
112
101
111
112
108
256
100
268
39
259
115
97
121
257
263
259
115
116
117
102
102
32
97
98
265
259
109
101
45
45
116
104
101
271
115
97
271
105
259
97
98
265
259
86
105
99
116
111
114
32
71
114
260
100
108
101
44
34
32
119
97
261
275
261
268
108
271
112
114
111
116
101
115
116
264
97
261
262
114
111
115
256
102
114
111
109
270
116
97
98
108
256
267
258
115
116
114
111
108
108
101
258
265
259
268
116
111
270
115
117
110
108
105
116
257
266
114
97
99
101
46
10
10
73
32
103
108
267
99
101
258
97
102
116
266
32
275
109
264
115
116
114
117
99
107
32
98
271
275
261
108
97
115
259
119
111
114
100
272
86
105
99
116
111
114
32
71
114
260
100
108
256
119
97
115
264
260
32
102
97
99
116
264
98
101
99
111
109
274
270
109
267
32
111
102
270
109
111
109
269
116
45
45
97
261
74
97
99
107
32
275
109
115
101
108
102
264
268
256
109
105
103
104
259
112
117
259
105
116
264
263
258
98
101
269
270
109
267
32
111
102
270
104
265
114
272
84
262
121
265
110
103
266
32
97
114
116
105
115
259
119
97
261
115
97
105
100
257
273
263
118
256
102
111
114
109
101
258
275
109
115
101
108
102
32
97
259
109
271
102
114
105
269
100
39
261
102
101
101
116
264
267
258
73
32
119
268
100
266
101
258
105
102
32
97
257
274
256
111
102
32
106
101
97
108
265
115
271
117
110
100
266
108
97
121
270
108
97
116
116
266
39
261
109
121
115
116
266
105
265
261
97
98
100
105
99
97
116
105
268
272
66
117
259
110
111
45
45
102
111
114
32
105
259
119
97
261
110
111
116
257
105
108
108
32
97
102
116
266
257
263
259
101
118
269
116
257
263
116
270
95
114
111
115
256
68
117
98
97
114
114
121
95
32
100
114
97
119
274
45
114
111
111
109
261
263
258
98
101
103
117
110
257
273
100
105
115
112
108
97
121
257
104
101
105
114
32
34
71
114
260
100
108
101
115
46
34
10
10
73
257
117
114
110
101
100
257
273
77
114
115
272
71
105
115
98
117
114
110
264
119
104
273
263
258
108
274
266
101
100
257
273
103
105
118
256
97
32
108
117
109
112
32
111
102
32
115
117
103
97
114
257
273
104
266
32
115
112
267
105
101
108
32
260
270
100
260
274
45
114
111
111
109
46
10
10
34
87
104
271
95
263
115
95
32
262
99
104
117
99
107
101
258
112
97
260
116
274
63
34
32
73
32
97
115
107
101
258
97
98
114
117
112
116
108
121
46
10
10
83
262
114
97
105
115
101
258
104
266
32
101
121
101
98
114
111
119
261
119
105
116
104
32
97
32
104
260
259
111
102
32
103
111
111
100
45
104
117
109
265
114
101
258
115
117
114
112
114
105
115
101
46
10
10
34
79
104
264
262
100
111
101
115
110
39
259
95
263
118
101
95
257
273
110
111
119
264
121
265
32
107
110
111
119
59
32
267
258
73
32
119
267
259
275
109
257
273
269
106
111
271
275
109
115
101
108
102
44
34
32
115
262
115
97
105
258
113
117
105
116
256
115
105
109
112
108
121
46
10
10
73
32
108
111
111
107
101
258
97
98
265
116
270
115
112
97
99
105
265
261
119
275
116
101
45
112
267
101
108
108
101
258
114
111
111
109
264
119
105
116
104
32
105
116
261
95
102
97
109
105
108
108
101
45
118
266
116
101
95
32
118
97
115
101
261
114
101
112
101
97
116
274
270
116
268
101
261
111
102
270
112
97
108
256
100
97
109
97
115
107
32
99
117
114
116
97
260
115
264
267
258
105
116
261
101
105
103
104
116
101
269
116
104
45
99
269
116
117
114
271
112
97
115
116
101
108
261
260
32
100
101
108
105
99
97
116
256
102
97
100
101
258
102
114
97
109
101
115
46
10
10
34
72
97
261
262
99
104
117
99
107
101
258
275
261
112
105
99
116
117
114
101
115
257
111
111
63
32
73
32
263
118
269
39
259
115
101
269
32
97
32
115
274
108
256
268
256
260
270
104
265
115
101
46
34
10
10
65
32
115
108
105
103
104
259
115
263
100
256
111
102
32
99
268
115
116
114
97
260
259
99
114
111
115
115
101
258
77
114
115
272
71
105
115
98
117
114
110
39
261
111
112
269
32
99
265
110
116
269
267
99
101
272
34
73
116
39
261
275
261
114
105
100
105
99
117
108
265
261
109
111
100
101
115
116
121
264
121
265
32
107
110
111
119
272
72
256
115
97
121
115
257
104
101
121
39
114
256
110
111
259
102
105
116
257
273
263
118
256
97
98
265
116
59
32
104
101
39
261
115
269
116
257
104
101
109
32
97
108
108
32
97
119
97
271
101
120
99
101
112
259
268
101
45
45
109
271
112
111
114
116
114
97
105
116
45
45
267
100
257
263
259
73
32
263
118
256
116
273
107
101
101
112
32
117
112
115
116
97
105
114
115
46
34
10
10
72
105
261
114
105
100
105
99
117
108
265
261
109
111
100
101
115
116
121
45
45
74
97
99
107
39
261
109
111
100
101
115
116
271
97
98
265
259
275
261
112
105
99
116
117
114
101
115
63
32
77
271
99
117
114
105
111
115
105
116
271
119
97
261
103
114
111
119
274
32
108
105
107
256
116
262
98
101
267
45
115
116
97
108
107
272
73
32
115
97
105
258
112
266
115
117
97
115
105
118
101
108
121
257
273
109
271
104
111
115
116
101
115
115
58
32
34
73
32
109
117
115
259
114
101
97
108
108
271
115
101
256
121
265
114
32
112
111
114
116
114
97
105
116
264
121
265
32
107
110
111
119
46
34
10
10
83
262
103
108
267
99
101
258
265
259
97
108
109
111
115
116
257
105
109
111
114
265
115
108
271
97
116
270
116
266
114
97
99
256
119
104
266
256
104
266
32
104
117
115
98
267
100
264
108
265
110
103
274
32
260
32
97
32
104
111
111
100
101
258
99
263
105
114
264
263
258
108
105
259
97
32
99
105
103
97
114
32
267
258
100
114
97
119
110
270
82
117
115
115
105
267
32
100
101
266
104
265
110
100
39
261
104
101
97
258
98
101
116
119
101
269
32
275
261
107
110
101
101
115
46
10
10
34
87
101
108
108
264
99
111
109
256
119
275
108
256
104
101
39
261
110
111
259
108
111
111
107
274
44
34
32
115
262
115
97
105
100
264
119
105
116
104
32
97
32
108
97
117
103
104
257
263
116
257
114
105
101
100
257
273
275
100
256
104
266
32
110
266
118
265
115
110
101
115
115
59
32
267
258
73
32
102
111
108
108
111
119
101
258
104
266
32
98
101
116
119
101
269
270
109
97
114
98
108
256
69
109
112
266
111
114
261
111
102
270
263
108
108
264
267
258
117
112
270
119
105
100
256
115
116
97
105
114
261
119
105
116
104
257
266
114
97
45
99
111
116
116
97
32
110
121
109
112
104
261
112
111
105
115
101
258
97
109
268
103
32
102
108
111
119
266
261
97
259
101
97
99
104
32
108
267
100
274
46
10
10
73
110
270
100
105
109
109
101
115
259
99
111
114
110
266
32
111
102
32
104
266
32
98
265
100
111
105
114
264
97
109
105
258
97
32
112
114
111
102
117
115
105
268
32
111
102
32
100
101
108
105
99
97
116
256
267
258
100
105
115
116
274
117
105
115
104
101
258
111
98
106
101
99
116
115
264
104
117
110
103
32
268
256
111
102
270
102
97
109
105
108
105
97
114
32
111
118
97
108
32
99
267
118
97
115
101
115
264
260
270
260
101
118
105
116
97
98
108
256
103
97
114
108
267
100
101
258
102
114
97
109
101
272
84
262
109
266
256
265
116
108
260
256
111
102
270
102
114
97
109
256
99
97
108
108
101
258
117
112
32
97
108
108
32
71
105
115
98
117
114
110
39
261
112
97
115
116
33
10
10
77
114
115
272
71
105
115
98
117
114
110
32
100
114
101
119
32
98
97
99
107
270
119
260
100
111
119
45
99
117
114
116
97
260
115
264
109
111
118
101
258
97
115
105
100
256
97
32
95
106
97
114
100
260
105
266
101
95
32
102
117
108
108
32
111
102
32
112
260
107
32
97
122
97
108
101
97
115
264
112
117
115
104
101
258
267
32
97
114
109
45
99
263
105
114
32
97
119
97
121
264
267
258
115
97
105
100
58
32
34
73
102
32
121
265
32
115
116
267
258
104
266
256
121
265
32
99
267
32
106
117
115
259
109
267
97
103
256
116
273
115
101
256
105
116
272
73
32
263
258
105
259
111
118
266
270
109
267
116
101
108
45
112
105
101
99
101
264
98
117
259
262
119
265
108
100
110
39
259
108
101
259
105
259
115
116
97
121
46
34
10
10
89
101
115
45
45
73
32
99
265
108
258
106
117
115
259
109
267
97
103
256
116
273
115
101
256
105
116
45
45
116
262
102
105
114
115
259
112
111
114
116
114
97
105
259
111
102
32
74
97
99
107
39
261
73
32
263
258
101
118
266
32
263
100
257
273
115
116
114
97
260
32
109
271
101
121
101
261
111
118
266
33
32
85
115
117
97
108
108
121
257
104
101
271
263
100
270
112
108
97
99
256
111
102
32
104
268
265
114
45
45
115
97
121
270
99
269
116
114
97
108
32
112
267
101
108
32
260
32
97
32
112
97
108
256
121
101
108
108
111
119
32
111
114
32
95
114
111
115
256
68
117
98
97
114
114
121
95
32
100
114
97
119
274
45
114
111
111
109
264
111
114
32
97
32
109
268
117
109
269
116
97
108
32
101
97
115
101
108
32
112
108
97
99
101
258
115
111
257
263
259
105
116
257
111
111
107
270
108
105
103
104
116
257
104
114
265
103
104
32
99
117
114
116
97
260
261
111
102
32
111
108
258
86
269
101
116
105
267
32
112
111
260
116
272
84
262
109
111
114
256
109
111
100
101
115
259
112
108
97
99
256
98
101
99
97
109
256
116
262
112
105
99
116
117
114
256
98
101
116
116
266
59
32
121
101
116
264
97
261
109
271
101
121
101
261
103
114
101
119
32
97
99
99
117
115
116
111
109
101
100
257
111
270
263
108
102
45
108
105
103
104
116
264
97
108
108
270
99
263
114
97
99
116
266
105
115
116
105
99
32
113
117
97
108
105
116
105
101
261
99
97
109
256
265
116
45
45
97
108
108
270
104
101
115
105
116
97
116
105
268
261
100
105
115
103
117
105
115
101
258
97
261
97
117
100
97
99
105
116
105
101
115
44
270
116
114
105
99
107
261
111
102
32
112
114
101
115
116
105
100
105
103
105
116
97
116
105
268
32
98
271
119
275
99
104
264
119
105
116
104
32
115
117
99
104
32
99
268
115
117
109
109
97
116
256
115
107
105
108
108
264
262
109
267
97
103
101
100
257
273
100
105
118
266
259
97
116
116
269
116
105
268
32
102
114
111
109
270
114
101
97
108
32
98
117
115
260
101
115
261
111
102
270
112
105
99
116
117
114
256
116
273
115
111
109
256
112
114
101
116
116
271
105
114
114
101
108
101
118
267
99
256
111
102
32
100
101
116
97
105
108
272
77
114
115
272
71
105
115
98
117
114
110
264
112
114
101
115
269
116
274
32
97
32
110
101
117
116
114
97
108
32
115
117
114
102
97
99
256
116
273
119
111
114
107
32
268
45
45
102
111
114
109
274
264
97
261
105
259
119
266
101
264
115
273
260
101
118
105
116
97
98
108
121
270
98
97
99
107
103
114
265
110
258
111
102
32
104
266
32
111
119
110
32
112
105
99
116
117
114
101
45
45
263
258
108
269
259
104
266
115
101
108
102
32
260
32
267
32
117
110
117
115
117
97
108
32
100
101
103
114
101
256
116
111
270
100
105
115
112
108
97
271
111
102
257
275
261
102
97
108
115
256
118
105
114
116
117
111
115
105
116
121
272
84
262
112
105
99
116
117
114
256
119
97
261
268
256
111
102
32
74
97
99
107
39
261
34
115
116
114
268
103
101
115
116
44
34
32
97
261
275
261
97
100
109
105
114
266
261
119
265
108
258
263
118
256
112
117
259
105
116
45
45
105
259
114
101
112
114
101
115
269
116
101
100
264
268
32
275
261
112
97
114
116
264
97
32
115
119
101
108
108
274
32
111
102
32
109
117
115
99
108
101
115
264
97
32
99
268
103
101
115
116
274
32
111
102
32
118
101
260
115
264
97
32
98
97
108
267
99
274
264
115
116
114
97
100
100
108
274
32
267
258
115
116
114
97
260
274
44
257
263
259
114
101
109
260
100
101
258
268
256
111
102
270
99
105
114
99
117
115
45
99
108
111
119
110
39
261
105
114
268
105
99
32
101
102
102
111
114
116
115
257
273
108
105
102
259
97
32
102
101
97
116
104
266
272
73
259
109
101
116
264
260
32
115
104
111
114
116
264
97
259
101
118
266
271
112
111
260
116
270
100
101
109
267
258
111
102
32
108
111
118
101
108
271
119
111
109
267
257
273
98
256
112
97
260
116
101
258
34
115
116
114
268
103
108
121
34
32
98
101
99
97
117
115
256
115
262
119
97
115
257
105
114
101
258
111
102
32
98
101
274
32
112
97
260
116
101
258
34
115
119
101
101
116
108
121
34
45
45
267
258
121
101
259
110
111
116
257
273
108
111
115
256
267
32
97
116
111
109
32
111
102
270
115
119
101
101
116
110
101
115
115
46
10
10
34
73
116
39
115
270
108
97
115
259
262
112
97
260
116
101
100
264
121
265
32
107
110
111
119
44
34
32
77
114
115
272
71
105
115
98
117
114
110
32
115
97
105
258
119
105
116
104
32
112
97
114
100
268
97
98
108
256
112
114
105
100
101
272
34
84
262
108
97
115
259
98
117
259
268
101
44
34
32
115
262
99
111
114
114
101
99
116
101
258
104
266
115
101
108
102
45
45
34
98
117
116
270
111
116
104
266
32
100
111
101
115
110
39
259
99
265
110
116
264
98
101
99
97
117
115
256
262
100
101
115
116
114
111
121
101
258
105
116
46
34
10
10
34
68
101
115
116
114
111
121
101
258
105
116
63
34
32
73
32
119
97
261
97
98
265
116
257
273
102
111
108
108
111
119
32
117
112
257
275
261
99
108
117
256
119
104
269
32
73
32
104
101
97
114
258
97
32
102
111
111
116
115
116
101
112
32
267
258
115
97
119
32
74
97
99
107
32
275
109
115
101
108
102
32
268
270
116
104
114
101
115
104
111
108
100
46
10
10
65
261
262
115
116
111
111
100
257
104
266
101
264
275
261
263
110
100
261
260
270
112
111
99
107
101
116
261
111
102
32
275
261
118
101
108
118
101
116
101
269
32
99
111
97
116
44
270
116
104
260
32
98
114
111
119
110
32
119
97
118
101
261
111
102
32
263
105
114
32
112
117
115
104
101
258
98
97
99
107
32
102
114
111
109
32
275
261
119
275
116
256
102
111
114
101
104
101
97
100
264
275
261
108
101
267
32
115
117
110
98
117
114
110
259
99
104
101
101
107
261
102
117
114
114
111
119
101
258
98
271
97
32
115
109
105
108
256
116
263
259
108
105
102
116
101
100
270
116
105
112
261
111
102
32
97
32
115
101
108
102
45
99
268
102
105
100
269
259
109
265
115
116
97
99
104
101
264
73
32
102
101
108
116
257
273
119
263
259
97
32
100
101
103
114
101
256
262
263
100
270
115
97
109
256
113
117
97
108
105
116
271
97
261
275
261
112
105
99
116
117
114
101
115
45
45
116
262
113
117
97
108
105
116
271
111
102
32
108
111
111
107
274
32
99
108
101
118
266
266
257
263
110
32
262
119
97
115
46
10
10
72
105
261
119
105
102
256
103
108
267
99
101
258
97
259
275
109
32
100
101
112
114
101
99
97
116
274
108
121
264
98
117
259
275
261
101
121
101
115
257
114
97
118
101
108
108
101
258
112
97
115
259
104
266
257
111
270
112
111
114
116
114
97
105
116
46
10
10
34
77
114
272
82
105
99
107
263
109
32
119
267
116
101
100
257
273
115
101
256
105
116
44
34
32
115
262
98
101
103
267
264
97
261
105
102
32
101
120
99
117
115
274
32
104
266
115
101
108
102
272
72
256
115
104
114
117
103
103
101
258
275
261
115
104
265
108
100
266
115
264
115
116
105
108
108
32
115
109
105
108
274
46
10
10
34
79
104
264
82
105
99
107
263
109
32
102
265
110
258
109
256
265
259
108
268
103
32
97
103
111
44
34
32
262
115
97
105
258
108
105
103
104
116
108
121
59
257
104
269
264
112
97
115
115
274
32
275
261
97
114
109
257
104
114
265
103
104
32
109
260
101
58
32
34
67
111
109
256
267
258
115
101
256
116
262
114
101
115
259
111
102
270
104
265
115
101
46
34
10
10
72
256
115
104
111
119
101
258
105
116
257
273
109
256
119
105
116
104
32
97
32
107
260
258
111
102
32
110
97
105
118
256
115
117
98
117
114
98
267
32
112
114
105
100
101
58
270
98
97
116
104
45
114
111
111
109
115
44
270
115
112
101
97
107
274
45
116
117
98
101
115
44
270
100
114
101
115
115
45
99
108
111
115
101
116
115
44
270
116
114
265
115
266
45
112
114
101
115
115
101
115
45
45
97
108
108
270
99
111
109
112
108
101
120
32
115
105
109
112
108
105
102
105
99
97
116
105
268
261
111
102
270
109
105
108
108
105
268
97
105
114
101
39
261
100
111
109
101
115
116
105
99
32
101
99
268
111
109
121
272
65
110
258
119
104
269
101
118
266
32
109
271
119
268
100
266
32
112
97
105
100
270
101
120
112
101
99
116
101
100
257
114
105
98
117
116
256
262
115
97
105
100
44
257
104
114
111
119
274
32
265
259
275
261
99
104
101
115
259
97
32
108
105
116
116
108
101
58
32
34
89
101
115
264
73
32
114
101
97
108
108
271
100
268
39
259
115
101
256
104
111
119
32
112
101
111
112
108
256
109
267
97
103
256
116
273
108
105
118
256
119
105
116
104
265
116
257
263
116
46
34
10
10
87
101
108
108
45
45
105
259
119
97
261
106
117
115
116
270
269
258
268
256
109
105
103
104
259
263
118
256
102
111
114
101
115
101
269
32
102
111
114
32
275
109
272
79
110
108
271
262
119
97
115
44
257
104
114
265
103
104
32
105
259
97
108
108
32
267
258
260
32
115
112
105
116
256
111
102
32
105
259
97
108
108
45
45
97
261
262
263
258
98
101
269
257
104
114
265
103
104
264
267
258
260
32
115
112
105
116
256
111
102
264
275
261
112
105
99
116
117
114
101
115
45
45
115
273
263
110
100
115
111
109
101
264
115
273
99
263
114
109
274
264
115
273
100
105
115
97
114
109
274
44
257
263
259
268
256
108
268
103
101
100
257
273
99
114
271
265
116
58
32
34
66
256
100
105
115
115
97
116
105
115
102
105
101
258
119
105
116
104
32
121
265
114
32
108
101
105
115
117
114
101
33
34
32
97
261
268
99
256
268
256
263
258
108
268
103
101
100
257
273
115
97
121
58
32
34
66
256
100
105
115
115
97
116
105
115
102
105
101
258
119
105
116
104
32
121
265
114
32
119
111
114
107
33
34
10
10
66
117
116
264
119
105
116
104
270
99
114
271
268
32
109
271
108
105
112
115
264
109
271
100
105
97
103
110
111
115
105
261
115
117
102
102
266
101
258
267
32
117
110
101
120
112
101
99
116
101
258
99
104
101
99
107
46
10
10
34
84
275
261
105
261
109
271
111
119
110
32
108
97
105
114
44
34
32
262
115
97
105
100
264
108
101
97
100
274
32
109
256
260
116
273
97
32
100
97
114
107
32
112
108
97
260
32
114
111
111
109
32
97
116
270
269
258
111
102
270
102
108
111
114
105
258
118
105
115
116
97
272
73
259
119
97
261
115
113
117
97
114
256
267
258
98
114
111
119
110
32
267
258
108
101
97
116
104
266
121
58
32
110
273
34
101
102
102
101
99
116
115
34
59
32
110
273
98
114
105
99
45
97
45
98
114
97
99
264
110
268
256
111
102
270
97
105
114
32
111
102
32
112
111
115
274
32
102
111
114
32
114
101
112
114
111
100
117
99
116
105
268
32
260
32
97
32
112
105
99
116
117
114
256
119
101
101
107
108
121
45
45
97
98
111
118
256
97
108
108
264
110
273
108
101
97
115
259
115
105
103
110
32
111
102
32
101
118
266
32
263
118
274
32
98
101
269
32
117
115
101
258
97
261
97
32
115
116
117
100
105
111
46
10
10
84
262
102
97
99
259
98
114
265
103
104
259
104
111
109
256
116
273
109
256
116
262
97
98
115
111
108
117
116
256
102
260
97
108
105
116
271
111
102
32
74
97
99
107
39
261
98
114
101
97
107
32
119
105
116
104
32
275
261
111
108
258
108
105
102
101
46
10
10
34
68
268
39
259
121
265
32
101
118
266
32
100
97
98
98
108
256
119
105
116
104
32
112
97
260
259
267
271
109
111
114
101
63
34
32
73
32
97
115
107
101
100
264
115
116
105
108
108
32
108
111
111
107
274
32
97
98
265
259
102
111
114
32
97
257
114
97
99
256
111
102
32
115
117
99
104
32
97
99
116
105
118
105
116
121
46
10
10
34
78
101
118
266
44
34
32
262
115
97
105
258
98
114
105
101
102
108
121
46
10
10
34
79
114
32
119
97
116
266
45
99
111
108
265
114
45
45
111
114
32
101
116
99
104
274
63
34
10
10
72
105
261
99
268
102
105
100
269
259
101
121
101
261
103
114
101
119
32
100
105
109
264
267
258
275
261
99
104
101
101
107
261
112
97
108
101
258
97
32
108
105
116
116
108
256
117
110
100
266
257
104
101
105
114
32
263
110
100
115
111
109
256
115
117
110
98
117
114
110
46
10
10
34
78
101
118
266
257
104
260
107
32
111
102
32
105
116
264
109
271
100
101
97
114
32
102
101
108
108
111
119
45
45
267
271
109
111
114
256
116
263
110
32
105
102
32
73
39
258
110
101
118
266
257
265
99
104
101
258
97
32
98
114
117
115
104
46
34
10
10
65
110
258
275
115
257
268
256
116
111
108
258
109
256
260
32
97
32
102
108
97
115
104
257
263
259
262
110
101
118
266
257
104
265
103
104
259
111
102
32
267
121
116
104
274
32
101
108
115
101
46
10
10
73
32
109
111
118
101
258
97
119
97
121
264
260
115
116
260
99
116
105
118
101
108
271
101
109
98
97
114
114
97
115
115
101
258
98
271
109
271
117
110
101
120
112
101
99
116
101
258
100
105
115
99
111
118
266
121
59
32
267
258
97
261
73
257
117
114
110
101
100
264
109
271
101
121
256
102
101
108
108
32
268
32
97
32
115
109
97
108
108
32
112
105
99
116
117
114
256
97
98
111
118
256
116
262
109
267
116
101
108
45
112
105
101
99
101
45
45
116
262
268
108
271
111
98
106
101
99
259
98
114
101
97
107
274
270
112
108
97
260
32
111
97
107
32
112
267
101
108
108
274
32
111
102
270
114
111
111
109
46
10
10
34
79
104
264
98
271
74
111
118
101
33
34
32
73
32
115
97
105
100
46
10
10
73
259
119
97
261
97
32
115
107
101
116
99
104
32
111
102
32
97
32
100
268
107
101
121
45
45
267
32
111
108
100
257
105
114
101
258
100
268
107
101
121
264
115
116
267
100
274
32
260
270
114
97
260
32
117
110
100
266
32
97
32
119
97
108
108
46
10
10
34
66
271
74
111
118
101
45
45
97
32
83
116
114
265
100
33
34
32
73
32
99
114
105
101
100
46
10
10
72
256
119
97
261
115
105
108
269
116
59
32
98
117
259
73
32
102
101
108
259
275
109
32
99
108
111
115
256
98
101
104
260
258
109
101
264
98
114
101
97
116
104
274
32
97
32
108
105
116
116
108
256
113
117
105
99
107
108
121
46
10
10
34
87
263
259
97
32
119
268
100
266
33
32
77
97
100
256
119
105
116
104
32
97
32
100
111
122
269
32
108
260
101
115
45
45
98
117
259
268
32
101
118
266
108
97
115
116
274
32
102
265
110
100
97
116
105
268
115
272
89
265
32
108
117
99
107
271
99
263
112
264
119
104
266
256
100
105
258
121
265
32
103
101
259
105
116
63
34
10
10
72
256
267
115
119
266
101
258
115
108
111
119
108
121
58
32
34
77
114
115
272
83
116
114
265
258
103
97
118
256
105
116
257
273
109
101
46
34
10
10
34
65
104
45
45
73
32
100
105
100
110
39
259
107
110
111
119
32
121
265
32
101
118
269
32
107
110
101
119
270
83
116
114
265
100
115
272
72
256
119
97
261
115
117
99
104
32
267
32
260
102
108
101
120
105
98
108
256
104
266
109
105
116
46
34
10
10
34
73
32
100
105
100
110
39
116
45
45
116
105
108
108
32
97
102
116
266
272
272
272
272
83
262
115
269
259
102
111
114
32
109
256
116
273
112
97
260
259
275
109
32
119
104
269
32
262
119
97
261
100
101
97
100
46
34
10
10
34
87
104
269
32
262
119
97
261
100
101
97
100
63
32
89
265
63
34
10
10
73
32
109
117
115
259
263
118
256
108
101
259
97
32
108
105
116
116
108
256
116
111
273
109
117
99
104
32
97
109
97
122
101
109
269
259
101
115
99
97
112
256
116
104
114
265
103
104
32
109
271
115
117
114
112
114
105
115
101
264
102
111
114
32
262
267
115
119
266
101
258
119
105
116
104
32
97
32
100
101
112
114
101
99
97
116
274
32
108
97
117
103
104
58
32
34
89
101
115
45
45
115
104
101
39
261
267
32
97
119
102
117
108
32
115
105
109
112
108
101
116
268
264
121
265
32
107
110
111
119
264
77
114
115
272
83
116
114
265
100
272
72
266
32
268
108
271
105
100
101
97
32
119
97
115
257
273
263
118
256
275
109
32
100
268
256
98
271
97
32
102
97
115
275
268
97
98
108
256
112
97
260
116
266
45
45
97
104
264
112
111
111
114
32
83
116
114
265
100
33
32
83
262
116
104
265
103
104
259
105
116
270
115
117
114
101
115
259
119
97
271
111
102
32
112
114
111
99
108
97
105
109
274
32
275
261
103
114
101
97
116
110
101
115
115
45
45
111
102
32
102
111
114
99
274
32
105
259
268
32
97
32
112
117
114
98
108
260
258
112
117
98
108
105
99
272
65
110
258
97
116
270
109
111
109
269
259
73
32
119
97
261
95
116
104
101
95
32
102
97
115
275
268
97
98
108
256
112
97
260
116
266
46
34
10
10
34
65
104
264
112
111
111
114
32
83
116
114
265
100
45
45
97
261
121
265
32
115
97
121
272
87
97
261
95
116
263
116
95
32
275
261
275
115
116
111
114
121
63
34
10
10
34
84
263
259
119
97
261
275
261
275
115
116
111
114
121
272
83
262
98
101
108
105
101
118
101
258
260
32
275
109
264
103
108
111
114
105
101
258
260
32
275
109
45
45
111
114
257
104
265
103
104
259
115
262
100
105
100
272
66
117
259
115
262
99
265
108
100
110
39
259
98
101
97
114
32
110
111
116
257
273
263
118
256
97
108
108
270
100
114
97
119
274
45
114
111
111
109
261
119
105
116
104
32
104
266
272
83
262
99
265
108
100
110
39
259
98
101
97
114
270
102
97
99
116
257
263
116
264
268
32
118
97
114
110
105
115
104
274
32
100
97
121
115
264
268
256
99
265
108
258
97
108
119
97
121
261
103
101
259
110
101
97
114
32
269
265
103
104
257
273
115
101
256
275
261
112
105
99
116
117
114
101
115
272
80
111
111
114
32
119
111
109
267
33
32
83
104
101
39
261
106
117
115
259
97
32
102
114
97
103
109
269
259
103
114
111
112
274
32
102
111
114
32
111
116
104
266
32
102
114
97
103
109
269
116
115
272
83
116
114
265
258
105
115
270
268
108
271
119
104
111
108
256
73
32
101
118
266
32
107
110
101
119
46
34
10
10
34
89
265
32
101
118
266
32
107
110
101
119
63
32
66
117
259
121
265
32
106
117
115
259
115
97
105
100
45
45
34
10
10
71
105
115
98
117
114
110
32
263
258
97
32
99
117
114
105
265
261
115
109
105
108
256
260
32
275
261
101
121
101
115
46
10
10
34
79
104
264
73
32
107
110
101
119
32
275
109
264
267
258
262
107
110
101
119
32
109
101
45
45
268
108
271
105
259
263
112
112
269
101
258
97
102
116
266
32
262
119
97
261
100
101
97
100
46
34
10
10
73
32
100
114
111
112
112
101
258
109
271
118
111
105
99
256
260
115
116
260
99
116
105
118
101
108
121
272
34
87
104
269
32
115
262
115
269
259
102
111
114
32
121
265
63
34
10
10
34
89
101
115
45
45
113
117
105
116
256
260
115
269
115
105
98
108
256
116
111
270
105
114
268
121
272
83
262
119
267
116
101
258
275
109
32
118
260
100
105
99
97
116
101
100
45
45
267
258
98
271
109
101
33
34
10
10
72
256
108
97
117
103
104
101
258
97
103
97
260
264
267
100
257
104
114
101
119
32
98
97
99
107
32
275
261
104
101
97
100
257
273
108
111
111
107
32
117
112
32
97
116
270
115
107
101
116
99
104
32
111
102
270
100
268
107
101
121
272
34
84
104
266
256
119
266
256
100
97
121
261
119
104
269
32
73
32
99
265
108
100
110
39
259
108
111
111
107
32
97
116
257
263
116
257
104
274
45
45
99
265
108
100
110
39
259
102
97
99
256
105
116
272
66
117
259
73
32
102
111
114
99
101
258
109
121
115
101
108
102
257
273
112
117
259
105
259
104
266
101
59
32
267
258
110
111
119
32
105
116
39
261
99
117
114
101
258
109
101
45
45
99
117
114
101
258
109
101
272
84
263
116
39
115
270
114
101
97
115
268
32
119
104
271
73
32
100
268
39
259
100
97
98
98
108
256
267
271
109
111
114
101
264
109
271
100
101
97
114
32
82
105
99
107
263
109
59
32
111
114
32
114
97
116
104
266
32
83
116
114
265
258
275
109
115
101
108
102
32
105
115
270
114
101
97
115
268
46
34
10
10
70
111
114
270
102
105
114
115
116
257
105
109
256
109
271
105
100
108
256
99
117
114
105
111
115
105
116
271
97
98
265
259
109
271
99
111
109
112
267
105
268
257
117
114
110
101
258
260
116
273
97
32
115
266
105
265
261
100
101
115
105
114
256
116
273
117
110
100
266
115
116
267
258
275
109
32
98
101
116
116
266
46
10
10
34
73
32
119
105
115
104
32
121
265
39
100
257
101
108
108
32
109
256
104
111
119
32
105
259
263
112
112
269
101
100
44
34
32
73
32
115
97
105
100
46
10
10
72
256
115
116
111
111
258
108
111
111
107
274
32
117
112
32
97
116
270
115
107
101
116
99
104
264
267
100
257
119
105
114
108
274
32
98
101
116
119
101
269
32
275
261
102
274
266
261
97
32
99
105
103
97
114
101
116
116
256
262
263
258
102
111
114
103
111
116
116
269
257
273
108
105
103
104
116
272
83
117
100
100
269
108
271
262
116
117
114
110
101
100
257
111
119
97
114
258
109
101
46
10
10
34
73
39
258
114
97
116
104
266
32
108
105
107
256
116
111
257
101
108
108
32
121
265
45
45
98
101
99
97
117
115
256
73
39
118
256
97
108
119
97
121
261
115
117
115
112
101
99
116
101
258
121
265
32
111
102
32
108
111
97
116
104
274
32
109
271
119
111
114
107
46
34
10
10
73
32
109
97
100
256
97
32
100
101
112
114
101
99
97
116
274
32
103
101
115
116
117
114
101
264
119
275
99
104
32
262
110
101
103
97
116
105
118
101
258
119
105
116
104
32
97
32
103
111
111
100
45
104
117
109
265
114
101
258
115
104
114
117
103
46
10
10
34
79
104
264
73
32
100
105
100
110
39
259
99
97
114
256
97
32
115
116
114
97
119
32
119
104
269
32
73
32
98
101
108
105
101
118
101
258
260
32
109
121
115
101
108
102
45
45
267
258
110
111
119
32
105
116
39
261
267
32
97
100
100
101
100
257
105
256
98
101
116
119
101
269
32
117
115
33
34
10
10
72
256
108
97
117
103
104
101
258
115
108
105
103
104
116
108
121
264
119
105
116
104
265
259
98
105
116
116
266
110
101
115
115
264
267
258
112
117
115
104
101
258
268
256
111
102
270
100
101
101
112
32
97
114
109
45
99
263
105
114
261
102
111
114
119
97
114
100
272
34
84
104
266
101
58
32
109
97
107
256
121
265
114
115
101
108
102
32
99
111
109
102
111
114
116
97
98
108
101
45
45
267
258
104
266
256
97
114
256
116
262
99
105
103
97
114
261
121
265
32
108
105
107
101
46
34
10
10
72
256
112
108
97
99
101
100
257
104
101
109
32
97
259
109
271
101
108
98
111
119
32
267
258
99
268
116
260
117
101
100
257
273
119
267
100
266
32
117
112
32
267
258
100
111
119
110
270
114
111
111
109
264
115
116
111
112
112
274
32
110
111
119
32
267
100
257
104
269
32
98
269
101
97
116
104
270
112
105
99
116
117
114
101
46
10
10
34
72
111
119
32
105
259
263
112
112
269
101
100
63
32
73
32
99
267
257
101
108
108
32
121
265
32
260
32
102
105
118
256
109
260
117
116
101
115
45
45
267
258
105
259
100
105
100
110
39
116
257
97
107
256
109
117
99
104
32
108
268
103
266
257
273
263
112
112
269
272
272
272
272
73
32
99
267
32
114
101
109
101
109
98
266
32
110
111
119
32
104
111
119
32
115
117
114
112
114
105
115
101
258
267
258
112
108
101
97
115
101
258
73
32
119
97
261
119
104
269
32
73
32
103
111
259
77
114
115
272
83
116
114
265
100
39
261
110
111
116
101
272
79
102
32
99
265
114
115
101
264
100
101
101
112
32
100
111
119
110
264
73
32
263
258
97
108
119
97
121
261
95
102
101
108
116
95
257
104
266
256
119
97
261
110
273
268
256
108
105
107
256
275
109
45
45
268
108
271
73
32
263
258
103
268
256
119
105
116
104
270
115
116
114
101
97
109
264
101
99
104
111
101
100
270
117
115
117
97
108
32
112
108
97
116
105
116
117
100
101
261
97
98
265
259
275
109
44
257
105
108
108
32
73
32
263
108
102
32
103
111
116
257
111
257
104
260
107
32
262
119
97
261
97
32
102
97
105
108
117
114
101
264
268
256
111
102
270
107
260
100
257
263
259
97
114
256
108
101
102
259
98
101
104
260
100
272
66
271
74
111
118
101
264
267
258
262
95
119
97
115
95
32
108
101
102
259
98
101
104
260
100
45
45
98
101
99
97
117
115
256
262
263
258
99
111
109
256
116
273
115
116
97
121
33
32
84
262
114
101
115
259
111
102
32
117
261
263
100
257
273
108
101
259
265
114
115
101
108
118
101
261
98
256
115
119
101
112
259
97
108
268
103
32
111
114
32
103
273
117
110
100
266
264
98
117
259
262
119
97
261
275
103
104
32
97
98
111
118
256
116
262
99
117
114
114
269
116
45
45
268
32
101
118
266
108
97
115
116
274
32
102
265
110
100
97
116
105
268
115
264
97
261
121
265
32
115
97
121
46
10
10
34
87
101
108
108
264
73
32
119
269
259
111
102
102
257
111
270
104
265
115
256
260
32
109
271
109
111
115
259
101
103
114
101
103
105
265
261
109
111
111
100
45
45
114
97
116
104
266
32
109
111
118
101
100
264
76
111
114
258
102
111
114
103
105
118
256
109
101
264
97
116
270
112
97
116
104
111
261
111
102
32
112
111
111
114
32
83
116
114
265
100
39
261
99
97
114
101
266
32
111
102
32
102
97
105
108
117
114
256
98
101
274
32
99
114
111
119
110
101
258
98
121
270
103
108
111
114
271
111
102
32
109
271
112
97
260
116
274
32
275
109
33
32
79
102
32
99
265
114
115
256
73
32
109
101
267
116
257
273
100
111
270
112
105
99
116
117
114
256
102
111
114
32
110
111
116
104
274
45
45
73
257
111
108
258
77
114
115
272
83
116
114
265
258
115
273
119
104
269
32
115
262
98
101
103
267
257
273
115
116
97
109
109
266
32
115
111
109
101
116
104
274
32
97
98
265
259
104
266
32
112
111
118
266
116
121
272
73
32
114
101
109
101
109
98
266
32
103
101
116
116
274
32
111
102
102
32
97
32
112
114
111
100
105
103
105
265
261
112
104
114
97
115
256
97
98
265
116
270
104
268
265
114
32
98
101
274
32
95
109
260
101
95
45
45
111
104
264
73
32
119
97
261
112
114
260
99
101
108
121
264
109
271
100
101
97
114
32
82
105
99
107
263
109
33
32
73
32
119
97
261
112
111
115
274
257
273
109
121
115
101
108
102
32
108
105
107
256
268
256
111
102
32
109
271
111
119
110
32
115
105
116
116
266
115
46
10
10
34
84
104
269
32
73
32
119
97
115
257
97
107
269
32
117
112
32
267
258
108
101
102
259
97
108
268
256
119
105
116
104
32
275
109
272
73
32
263
258
115
269
259
97
108
108
32
109
121
257
114
97
112
261
260
32
97
100
118
267
99
101
264
267
258
73
32
263
258
268
108
121
257
273
115
101
259
117
112
270
101
97
115
101
108
32
267
258
103
101
116
257
273
119
111
114
107
272
72
256
263
258
98
101
269
32
100
101
97
258
268
108
121
257
119
269
116
121
45
102
265
114
32
104
265
114
115
264
267
258
262
100
105
101
258
115
117
100
100
269
108
121
264
111
102
32
104
101
97
114
259
100
105
115
101
97
115
101
264
115
111
257
263
116
257
104
266
256
263
258
98
101
269
32
110
273
112
114
101
108
105
109
260
97
114
271
119
111
114
107
32
111
102
32
100
101
115
116
114
117
99
116
105
268
45
45
275
261
102
97
99
256
119
97
261
99
108
101
97
114
32
267
258
117
110
116
265
99
104
101
100
272
73
32
263
258
109
101
259
275
109
32
268
99
256
111
114
257
119
105
99
101
264
121
101
97
114
261
98
101
102
111
114
101
264
267
100
257
104
265
103
104
259
275
109
32
260
115
105
103
110
105
102
105
99
267
259
267
258
100
274
121
272
78
111
119
32
73
32
115
97
119
257
263
259
262
119
97
261
115
117
112
266
98
46
10
10
34
73
32
119
97
261
103
108
97
258
97
259
102
105
114
115
116
264
119
105
116
104
32
97
32
109
266
101
108
271
97
101
115
116
104
101
116
105
99
32
115
97
116
105
115
102
97
99
116
105
268
58
32
103
108
97
100
257
273
263
118
256
109
271
263
110
258
268
32
115
117
99
104
32
97
32
39
115
117
98
106
101
99
116
46
39
32
84
104
269
32
275
261
115
116
114
267
103
256
108
105
102
101
45
108
105
107
269
101
115
261
98
101
103
267
257
273
97
102
102
101
99
259
109
256
113
117
101
266
108
121
45
45
97
261
73
32
98
108
111
99
107
101
100
270
104
101
97
258
260
32
73
32
102
101
108
259
97
261
105
102
32
262
119
266
256
119
97
116
99
104
274
32
109
256
100
273
105
116
272
84
262
115
269
115
97
116
105
268
32
119
97
261
102
111
108
108
111
119
101
258
98
121
270
116
104
265
103
104
116
58
32
105
102
32
262
95
119
266
101
95
32
119
97
116
99
104
274
32
109
101
264
119
263
259
119
265
108
258
262
115
97
121
257
273
109
271
119
97
271
111
102
32
119
111
114
107
274
63
32
77
271
115
116
114
111
107
101
261
98
101
103
267
257
273
103
273
97
32
108
105
116
116
108
256
119
105
108
100
45
45
73
32
102
101
108
259
110
266
118
265
261
267
258
117
110
99
266
116
97
260
46
10
10
34
79
110
99
101
264
119
104
269
32
73
32
108
111
111
107
101
258
117
112
264
73
32
115
101
101
109
101
100
257
273
115
101
256
97
32
115
109
105
108
256
98
101
104
260
258
275
261
99
108
111
115
256
103
114
97
121
105
115
104
32
98
101
97
114
100
45
45
97
261
105
102
32
262
263
100
270
115
101
99
114
101
116
264
267
258
119
266
256
97
109
117
115
274
32
275
109
115
101
108
102
32
98
271
104
111
108
100
274
32
105
259
98
97
99
107
32
102
114
111
109
32
109
101
272
84
263
259
101
120
97
115
112
266
97
116
101
258
109
256
115
116
105
108
108
32
109
111
114
101
272
84
262
115
101
99
114
101
116
63
32
87
104
121
264
73
32
263
258
97
32
115
101
99
114
101
259
119
111
114
116
104
257
119
269
116
271
111
102
32
275
115
33
32
73
32
100
97
115
104
101
258
97
116
270
99
267
118
97
261
102
117
114
105
265
115
108
121
264
267
100
257
114
105
101
258
115
111
109
256
111
102
32
109
271
98
114
97
118
117
114
97
257
114
105
99
107
115
272
66
117
116
257
104
101
271
102
97
105
108
101
258
109
101
44
257
104
101
271
99
114
117
109
98
108
101
100
272
73
32
115
97
119
257
263
259
262
119
97
115
110
39
259
119
97
116
99
104
274
270
115
104
111
119
271
98
105
116
115
45
45
73
32
99
265
108
100
110
39
259
100
105
115
116
114
97
99
259
275
261
97
116
116
269
116
105
268
59
32
262
106
117
115
259
107
101
112
259
275
261
101
121
101
261
268
270
263
114
258
112
97
115
115
97
103
101
261
98
101
116
119
101
269
272
84
104
111
115
256
119
266
256
116
262
268
101
261
73
32
263
258
97
108
119
97
121
261
115
275
114
107
101
100
264
111
114
32
99
111
118
266
101
258
117
112
32
119
105
116
104
32
115
111
109
256
108
121
274
32
112
97
260
116
272
65
110
258
104
111
119
32
262
115
97
119
257
104
114
265
103
104
32
109
271
108
105
101
115
33
10
10
34
73
32
108
111
111
107
101
258
117
112
32
97
103
97
260
264
267
258
99
97
117
103
104
259
115
105
103
104
259
111
102
257
263
259
115
107
101
116
99
104
32
111
102
270
100
268
107
101
271
263
110
103
274
32
268
270
119
97
108
108
32
110
101
97
114
32
275
